word_dict = {
        'a':'あ', 'i':'い', 'u':'う', 'e':'え', 'o':'お',
        'ka':'か', 'ki':'き', 'ku':'く', 'ke':'け', 'ko':'こ',
        'sa':'さ', 'shi':'し', 'su':'す', 'se':'せ', 'so':'そ', 'si':'し',
        'ta':'た', 'chi':'ち', 'tsu':'つ', 'te':'て', 'to':'と',
        'na':'な', 'ni':'に', 'nu':'ぬ', 'ne':'ね', 'no':'の',
        'ha':'は', 'hi':'ひ', 'fu':'ふ', 'he':'へ', 'ho':'ほ',
        'ma':'ま', 'mi':'み', 'mu':'む', 'me':'め', 'mo':'も',
        'ya':'や', 'yu':'ゆ', 'yo':'よ', 'ra':'ら', 'ri':'り',
        'ru':'る', 're':'れ', 'ro':'ろ', 'wa':'わ', 'wo':'を',
        'n':'ん',

        'ga':'が', 'gi':'ぎ', 'gu':'ぐ', 'ge':'げ', 'go':'ご',
        'za':'ざ', 'ji':'じ', 'zu':'ず', 'ze':'ぜ', 'zo':'ぞ',
        'da':'だ', 'de':'で', 'do':'ど',
        'ba':'ば', 'bi':'び', 'bu':'ぶ', 'be':'べ', 'bo':'ぼ',
        'pa':'ぱ', 'pi':'ぴ', 'pu':'ぷ', 'pe':'ぺ', 'po':'ぽ',

        'kya': 'きゃ', 'kyo': 'きょ', 'kyu': 'きゅ', 'sya': 'しゃ', 'syu': 'しゅ', 'syo': 'しょ',
        'cya': 'ちゃ', 'chu': 'ちゅ', 'cho': 'ちょ', 'nya': 'にゃ', 'nyu': 'にゅ', 'nyo': 'にょ',
        'hya': 'ひゃ', 'hyo': 'ひょ', 'hyu': 'ひゅ',
        'mya': 'みゃ', 'myu': 'みゅ', 'myo': 'みょ', 'rya': 'りゃ', 'ryu': 'りゅ', 'ryo': 'りょ',

        'gya': 'ぎゃ', 'gyo': 'ぎょ', 'gyu': 'ぎゅ', 'jya': 'じゃ', 'jyu': 'じゅ', 'jyo': 'じょ',
        'bya': 'びゃ', 'byu': 'びゅ', 'byo': 'びょ',
        'pya': 'ぴゃ', 'pyo': 'ぴょ', 'pyu': 'ぴょ',

        'va':'ヴァ', 'xtu':'っ',  '-':'ー'
        }